const medicines = [
  { name:"METFORMIN 500 mg", img:"https://i.ibb.co/Gf0NsZJN/glucophage.jpg", type:"tablets", uses:"لعلاج السكري من النوع الثاني ",
  short: "يوخذ بعد الأكل-الجرعة القصوى: 2000–2550 mg في اليوم", 
   details:`💊 METFORMIN 500MG
<h4> 🕒 طريقة الاستخدام/ </h4>
<p>
1.	عادةً يبدأ العلاج بجرعة منخفضة (500 ملغ مرة أو مرتين يوميًا) بعد الأكل لتقليل اضطرابات المعدة.
2.	تُبلع الأقراص كاملة مع الماء، ولا تُكسر أو تُسحق.
	⚠️ الطبيب هو من يحدد الجرعة حسب الحالة الطبية وسكر الدم.
</p>

<h4> 🕒 💊 الاستخدامات الشائعة </h4>
<p>  
1.	داء السكري من النوع الثاني 
2.	متلازمة تكيس المبايض (في بعض الحالات)
3.	الوقاية من تطور السكري لدى الأشخاص ذوي الخطورة العالية. </p>

      <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
1.	اضطرابات في المعدة أو إسهال خفيف.
2.	غثيان أو فقدان شهية. 
3.	طعم معدني في الفم أحيانًا..</p> 

 <h4>️⚕️ تحذيرات </h4>
<p> 
1.	لا يُستخدم في مرضى الكلى الشديدة أو الفشل الكلوي.
2.	يُوقف مؤقتًا قبل إجراء فحوصات تحتوي على صبغة أو جراحة كبرى. 
3.	يُستخدم بحذر أثناء الحمل أو الرضاعة.
4.	يُجنب شرب الكحول لتفادي خطر الحماض اللبني.
.</p>
    <h4> 🚨 متى تراجع الطبيب؟ </h4>
<p>
	 إذا حدث غثيان شديد أو قيء متكرر.
	تعب أو دوخة شديدة أو تنفس سريع (قد تشير إلى الحماض اللبني). 
	اصفرار الجلد أو البول الداكن (قد يدل على مشكلة بالكبد)...</p>
      <h4>️ 📦 التخزين </h4>
<p> يُحفظ في درجة حرارة الغرفة (أقل من 30°C)، بعيدًا عن الرطوبة والضوء المباشر وأيدي الأطفال
.</p>
`},

  { name:"GLICLAZIDE MR 30 mg",          img:"https://i.ibb.co/fzXfYsK6/diamicron.jpg", 
   type:"tablets", 
   uses:"يخفض مستوى السكر / Lowers blood sugar",
   short:"يؤخذ مع وجبة الإفطار-الجرعة القصوى 120 ملجم في اليوم",
   details:`💊 GLICLAZIDE MR 30MG<h4> 🕒 طريقة الاستخدام/ </h4>
<p> 
1.	يُؤخذ عادة قرص واحد (30 ملغ) مرة واحدة يوميًا مع وجبة الإفطار
2.	يجب بلع القرص كاملاً دون كسر أو مضغ.</p>
      <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
•	انخفاض مستوى السكر في الدم (دوخة، تعرّق، جوع). 
•	صداع أو غثيان بسيط. 
•	زيادة طفيفة في الوزن أحيانًا.
.</p> 
      <h4>️⚕️ تحذيرات </h4>
<p> 
1.	لا يُستخدم في السكري من النوع الأول أو عند استخدام الإنسولين.
2.	 يُستخدم بحذر في أمراض الكبد أو الكلى. 
3.	تجنّب تخطي الوجبات أو الصيام الطويل لتفادي هبوط السكر.
4.	 لا يُنصح به أثناء الحمل أو الرضاعة إلا بتوجيه الطبيب..</p>
      <h4>️ 📦 التخزين </h4>
<p> يُحفظ في درجة حرارة الغرفة (أقل من 30°C)، بعيدًا عن الرطوبة والضوء المباشر وأيدي الأطفال
.</p>
`},

  { name:"SITAGLIPTIN 100 mg", img:"https://i.ibb.co/1fSrCMbD/januvia.jpg",
   type:"tablets", 
   uses:"ينظم السكر/ Controls sugar",
   short:"يمكن تناوله في أي وقت من اليوم (مع أو بدون طعام ) - الجرعة القصوى: 100 mg في اليوم.",
   details:`💊 SITAGLIPTIN 100MG
الاستخدام: تحسين سكر الدم<h4> 🕒 طريقة الاستخدام/ </h4>
<p>
	عادةً قرص واحد (100 ملغ) مرة واحدة يوميًا، مع أو بدون طعام.
	الطبيب هو من يحدد الجرعة المناسبة خاصة في حالات أمراض الكلى.
</p>
<h4> 🕒 💊 الاستخدامات الشائعة </h4>
<p>  
1.	داء السكري من النوع الثاني 
2.	يمكن استخدامه بمفرده أو مع أدوية أخرى خافضة للسكر.</p>
      <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
1.	صداع أو دوخة خفيفة..
2.	غثيان أو اضطرابات في المعدة..
3.	التهابات بسيطة في الجهاز التنفسي أو الحلق..</p> 
      <h4>️⚕️ تحذيرات </h4>
	<p> لا يُستخدم في السكري من النوع الأول أو عند استخدام الإنسولين كعلاج أساسي.
	يجب مراقبة وظائف الكلى بانتظام.
	يُستخدم بحذر أثناء الحمل أو الرضاعة.
	يُجنب الإفراط في تناول الكحول..</p>
     <h4> 🚨 متى تراجع الطبيب؟ </h4>
<p>
1.	 ألم شديد في البطن أو الغثيان المستمر (قد يدل على التهاب البنكرياس).
2.	تورم في الوجه أو اللسان أو صعوبة في التنفس (علامة تحسس).
3.	ألم في المفاصل أو العضلات.
.</p>
      <h4>️ 📦 التخزين </h4>
•	<p> يُحفظ في درجة حرارة الغرفة (أقل من 30°C)، بعيدًا عن الرطوبة والضوء المباشر وأيدي الأطفال
.</p>
`},

  { name:"DAPAGLIFLOZIN 10 mg", img:"https://i.ibb.co/rRjSDRz0/forxiga.jpg",
   type:"tablets", 
   uses:"يخفض السكر عن طريق الكلى", 
   short:"يوخذ صباحًا، مرة واحدة يوميًا، مع أو بدون طعام-الجرعة القصوى: 10 mg في اليوم",
   details:`💊 DAPAGLIFLOZIN 10MG
  <h4> 🕒 طريقة الاستخدام/ </h4>
<p>
1.	يُؤخذ قرص واحد (10 ملغ) مرة واحدة يوميًا، مع أو بدون طعام، ويفضل في نفس الوقت كل يوم.
	الطبيب هو من يحدد الجرعة المناسبة حسب الحالة.
</p>
<h4> 🕒 💊 الاستخدامات الشائعة </h4>
<p>  
1.	داء السكري من النوع الثاني – لتحسين التحكم في مستوى السكر.
2.	 قصور القلب – لتقليل خطر الدخول للمستشفى.
3.	 مرض الكلى المزمن – لحماية وظائف الكلى..</p>
      <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
1.	زيادة التبول. 
2.	عطش أو جفاف بسيط. 
3.	التهابات فطرية في المنطقة التناسلية.
4.	دوخة أو انخفاض بسيط في ضغط الدم...</p> 
      <h4>️⚕️ تحذيرات </h4>
<p> 
1.	لا يُستخدم لمرضى السكري من النوع الأول.
2.	يُستخدم بحذر في أمراض الكلى أو الكبد.
3.	لا يُنصح به أثناء الحمل أو الرضاعة إلا بأمر الطبيب.
4.	لا توقف الدواء فجأة دون استشارة الطبيب.
.</p>
      <h4> 🚨 متى تراجع الطبيب؟ </h4>
<p>
1.	 عطش شديد جدًا أو جفاف حاد.
2.	رائحة فم تشبه الفاكهة.
3.	ألم أو احمرار في المنطقة التناسلية. 
1.	تورم أو ضيق في التنفس..</p>
      <h4>️ 📦 التخزين </h4>
<p> يُحفظ في درجة حرارة الغرفة (أقل من 30°C)، بعيدًا عن الرطوبة والضوء المباشر وأيدي الأطفال
.</p>
`},

 {name: "GLIBENCLAMIDE 5 mg",
  img: "https://i.ibb.co/MqX7xfH/melix.jpg",
  type: "tablets",
  uses: "مضاد سكري فموي / Oral hypoglycemic",
  
  // ❗ معلومات بسيطة تظهر في النافذة الأولى
  short: `• يُؤخذ قبل الأكل بـ 30 دقيقة (الإفطار)
• الجرعة القصوى: 20 mg في اليوم`,

  // ❗ التفاصيل الكاملة تظهر عند الضغط على "اقرأ المزيد"
  details: `💊 GLIBENCLAMIDE 5MG
<h4> 🕒 طريقة الاستخدام/ </h4>
<p>
1.	يُؤخذ عادة مرة أو مرتين يومياً قبل الوجبات (خاصة قبل الفطور).
	يجب الالتزام بالجرعة التي يحددها الطبيب لتجنب انخفاض السكر.
</p>

<h4> 🕒 💊 الاستخدامات الشائعة </h4>
<p>  
1.	داء السكري من النوع الثاني / Type 2 Diabetes Mellitus
2.	غالباً ما يُستخدم مع الحمية الغذائية وممارسة الرياضة أو مع أدوية أخرى خافضة للسكر.
</p>
      <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
1.	انخفاض السكر في الدم (تعب، دوخة، تعرّق).
2.	غثيان أو اضطرابات في المعدة.
3.	زيادة خفيفة في الوزن.</p> 

<h4>️⚕️ تحذيرات </h4>
<p> 
1.	لا يُستخدم في مرضى السكري من النوع الأول أو مع الكيتواسيدوز السكري.
2.	يجب الحذر في كبار السن ومرضى الكبد والكلى.
3.	لا يُنصح بتناوله أثناء الحمل أو الرضاعة إلا بتوجيه الطبيب.
..</p>
<h4> 🚨 متى تراجع الطبيب؟ </h4>
<p> 
1.	أعراض انخفاض السكر الحادة (دوخة شديدة، فقدان وعي).
2.	اصفرار العينين أو الجلد.
3.	ألم في الصدر أو ضيق في التنفس.
.</p>
<h4>️ 📦 التخزين </h4>
<p> يُحفظ في درجة حرارة الغرفة (أقل من 30°C)، بعيدًا عن الرطوبة والضوء المباشر وأيدي الأطفال
.</p>
`
},
  { name:"GLIMEPIRIDE 2 mg", img:"https://i.ibb.co/V0T3BWPM/amaryl.jpg", 
   type:"tablets", 
   uses:"يزيد إفراز الإنسولين",
   short:" •	يوخذ قبل الإفطار مباشرة أو مع أول وجبة في اليوم  •	الجرعة القصوى: 8 mg في اليوم ",
   details:`💊 GLIMEPIRIDE 2MG
   <h4> 🕒 💊 الاستخدامات الشائعة </h4>
<p>  
	يُستخدم لعلاج داء السكري من النوع الثاني (Type 2 Diabetes Mellitus)، لتحسين التحكم في مستوى السكر في الدم عندما لا تكفي الحمية والرياضة وحدهما.
. </p>

      <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
1.	انخفاض السكر في الدم 
2.	دوخة أو صداع
3.	زيادة الوزن
4.	غثيان خفيف أو اضطراب بالمعدة..</p> 

  <h4>️⚕️ تحذيرات </h4>
<p> 
	يجب تجنب استخدامه في مرضى السكري من النوع الأول أو الحماض الكيتوني.
	يُستخدم بحذر في المرضى كبار السن أو الذين يعانون من أمراض الكبد أو الكلى.
	لا يُنصح بتناول الكحول أثناء استخدامه لأنه قد يزيد خطر انخفاض السكر.
.</p>
      <h4>️ 📦 التخزين </h4>
<p> يُحفظ في درجة حرارة الغرفة (أقل من 30°C)، بعيدًا عن الرطوبة والضوء المباشر وأيدي الأطفال
.</p>
      <h4> تصنيف الحمل </h4>
<p> 
الفئة C: لا توجد دراسات كافية على البشر؛ يُستخدم فقط إذا كانت الفائدة المرجوة تفوق الخطر المحتمل على الجنين.
.</p>
`},
  // الحقن
  { name:"LANTUS SoloStar", img:"https://i.ibb.co/xQB90Cr/lantus.jpg", type:"injections", uses:"إنسولين طويل المفعول",
   short:"إنسولين طويل المفعول - يُحقن مرة واحدة يوميًا في نفس الوقت كل يوم." ,
   details:`💉 LANTUS
   <h4> 🕒 ألية العمل </h4>
<p>
1.	يتبلور تحت الجلد ويُطلق ببطء وثبات خلال اليوم.
2.	يوفر Basal insulin مشابه للإفراز الطبيعي للبنكرياس طوال 24 ساعة.
3.	لا يستخدم لتغطية الوجبات لأنه ليس سريع المفعول.
. <p>
<h4> 🕒 💊 الاستخدامات الشائعة </h4>
<p>  
1.	السكري من النوع الأول (مع إنسولين سريع للوجبات).
2.	السكري من النوع الثاني كعلاج Basal.
3.	الحفاظ على مستوى السكر الصائم (Fasting glucose).
4.	البديل للـ NPH، لكنه أكثر ثباتًا وأقل تسببًا في الهبوط الليلي.

	بداية وتأثيره:
-البداية: 1–2 ساعة
-لا يوجد ذروة واضحة (ثابت ومستمر)
-المدة: حتى 24 ساعة

..</p>
      <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
	الشائعة:
10.	هبوط سكر الدم (Hypoglycemia)
11.	زيادة الوزن
12.	ألم أو احمرار في موضع الحقن

	الأقل شيوعًا:
10.	تورّم خفيف
11.	تكتلات دهنية (Lipodystrophy)
12.	حساسية نادرة جدًا للإنسولين
..</p> 
      <h4>️⚕️ تحذيرات </h4>
<p> 
	تغيير مواقع الحقن باستمرار لتجنب التكتلات.
	الحذر مع مرضى الكلى أو الكبد لضبط الجرعة.
	لا يُمزج مع أي إنسولين آخر في نفس السرنجة.
	يجب حقنه في نفس الوقت يوميًا.
	مراقبة السكر الصائم بانتظام لتعديل الجرعة.</p>
      <h4> طريقة استخدام الإنسولين </h4>
<p>
	التحضير قبل الحقن
1.اغسل يديك جيدًا.
2.تأكد أن الإنسولين ليس منتهي الصلاحية.
3.تأكد من شكله

	اختيار مكان الحقن
أفضل الأماكن: البطن (الأسرع امتصاصًا) / الفخذين / الذراع العلوي / الأرداف.

	ملاحظة مهمة:
بدّل  مكان الحقن كل مرة لتجنب تكتل الدهون تحت الجلد (Lipodystrophy).

	خطوات الحقن باستخدام القلم (Insulin Pen)
1. أزيل الغطاء.
2. ركّب الإبرة الجديدة.
3. قم بعمل priming:
4.اضغط وحدتين للتأكد من خروج نقطة من الإنسولين.
5. اضبط الجرعة المطلوبة باستخدام القرص.
6. امسك الجلد بيدك (إن كان الدهون قليلة).
7. أدخل الإبرة بزاوية 90° (أو 45° في الأشخاص النحيفين).
8. اضغط زر الجرعة بالكامل.
9. انتظر 10 ثوانٍ قبل سحب الإبرة لضمان دخول الجرعة كاملة.
10. تخلص من الإبرة في علبة التخلص من الإبر (Sharps container).
	بعد الحقن
لا تقوم بتدليك مكان الحقن..</p>
      <h4>️ 📦 التخزين </h4>
<p>
	قبل الفتح:
يُحفظ في الثلاجة 2–8°C، بعيدًا عن التجميد.
	بعد الفتح (قلم/قارورة):
يُحفظ في درجة الغرفة لمدة 28–30 يومًا كحد أقصى.
	يُبعد عن الحرارة المباشرة وأشعة الشمس.
	لا يُجمَّد أبدًا.
	تخلص من القلم بعد انتهاء المدة حتى لو بقي فيه إنسولين
.</p>
`},
  { name:"NovoRapid Penfill", img:"https://i.ibb.co/m5nGVZS3/novorapid.jpg", type:"injections", uses:"إنسولين سريع",
   short:"إنسولين سريع المفعول - يُحقن قبل الوجبة مباشرة (0–15 دقيقة)." ,
   details:`💉 NOVORAPID
   <h4> 🕒 ألية العمل </h4>
<p>
1.	يقلّد إفراز الإنسولين الطبيعي أثناء الوجبة.
2.	يساعد على دخول الجلوكوز إلى الخلايا وخفض سكر الدم بعد الطعام.
3.	يتم امتصاصه سريعًا بسبب تعديلات طفيفة في تركيبه الكيميائي.
. <p>

<h4> 🕒 💊 الاستخدامات الشائعة </h4>
<p>  
1.	علاج السكري النوع الأول (Type 1).
2.	علاج السكري النوع الثاني (Type 2) عند الحاجة للإنسولين.
3.	التحكم بسكر الوجبة (Prandial insulin).
4.	تعديل / تصحيح ارتفاع السكر (Correction doses).
5.	يستخدم مع إنسولين قاعدي (Basal insulin) في الأنظمة المكثفة.

	بداية وتأثيره:
-	يبدأ خلال 10–15 دقيقة
-	ذروة 1–2 ساعة
-	يستمر 3–5 ساعات
..</p>
      <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
	الشائعة:
4.	هبوط سكر الدم (Hypoglycemia)
5.	زيادة الوزن
6.	ألم أو احمرار في موضع الحقن

	الأقل شيوعًا:
4.	تورّم خفيف
5.	تكتلات دهنية (Lipodystrophy)
6.	حساسية نادرة جدًا للإنسولين
..</p> 

      <h4>️⚕️ تحذيرات </h4>
<p> 
	تغيير مواقع الحقن باستمرار لتجنب التكتلات.
	الحذر مع مرضى الكلى أو الكبد لضبط الجرعة.
	الانتباه لأعراض هبوط السكر:
رجفة – عرق – جوع – دوخة – نبض سريع
	يجب ضبط الجرعات عند: المرض/ النشاط البدني العالي/ تغيّر نمط الأكل

	لا يستخدم إلا إذا كان شفافًا وصافيًا (لا يجب أن يكون عكرًا).
.</p>
      <h4> طريقة استخدام الإنسولين </h4>
<p>
	التحضير قبل الحقن
1.اغسل يديك جيدًا.
     2.تأكد أن الإنسولين ليس منتهي الصلاحية.
3.تأكد من شكله

	اختيار مكان الحقن
أفضل الأماكن: البطن (الأسرع امتصاصًا) / الفخذين / الذراع العلوي / الأرداف.

	ملاحظة مهمة:
بدّل  مكان الحقن كل مرة لتجنب تكتل الدهون تحت الجلد (Lipodystrophy).

	خطوات الحقن باستخدام القلم (Insulin Pen)
1. أزيل الغطاء.
2. ركّب الإبرة الجديدة.
3. قم بعمل priming:
4.اضغط وحدتين للتأكد من خروج نقطة من الإنسولين.
5. اضبط الجرعة المطلوبة باستخدام القرص.
6. امسك الجلد بيدك (إن كان الدهون قليلة).
7. أدخل الإبرة بزاوية 90° (أو 45° في الأشخاص النحيفين).
8. اضغط زر الجرعة بالكامل.
9. انتظر 10 ثوانٍ قبل سحب الإبرة لضمان دخول الجرعة كاملة.
10. تخلص من الإبرة في علبة التخلص من الإبر (Sharps container).
	بعد الحقن
لا تقوم بتدليك مكان الحقن..</p>
     <h4>️ 📦 التخزين </h4>
<p>
	قبل الفتح:
يُحفظ في الثلاجة 2–8°C، بعيدًا عن التجميد.
	بعد الفتح (قلم/قارورة):
يُحفظ في درجة الغرفة لمدة 28–30 يومًا كحد أقصى.
	يُبعد عن الحرارة المباشرة وأشعة الشمس.
	لا يُجمَّد أبدًا..</p>
`},
  { name:"Mixtard 30/70 أو Insulin Human 30/70", img:"https://i.ibb.co/SXQZpp5v/mixtard.jpg",
   type:"injections", 
   uses:"إنسولين مخلوط", 
   short:"التركيبة: 30% Insulin Regular سريع المفعول + 70% NPH طويل المفعول - يُحقن قبل الوجبة بـ 30 دقيقة." ,
   details:`💉 MIXTARD
   <h4> 🕒 ألية العمل </h4>
<p>
	الجزء السريع (Regular 30%):
يخفض السكر بعد الوجبة عبر تسهيل دخول الجلوكوز للخلايا.
	الجزء المتوسط (NPH 70%):
يعطي تغطية ممتدة لعدة ساعات ويحافظ على سكر الدم بين الوجبات وخلال الليل. <p>
<h4> 🕒 💊 الاستخدامات الشائعة </h4>
<p>  
1.	علاج داء السكري النوع الأول.
2.	علاج داء السكري النوع الثاني عند عدم سيطرة السكر على الأقراص فقط.
3.	مناسب للمرضى الذين يحتاجون لمزيج يغطي وجبة الطعام والبازال (الأساس اليومي) بنفس الوقت...</p>
      <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
	الأكثر شيوعًا:
1.	هبوط سكر الدم (Hypoglycemia)
2.	زيادة الوزن
3.	احمرار أو ألم مكان الحقن

	أقل شيوعًا:
1.	تكتلات دهنية مكان الحقن (Lipodystrophy)
2.	تورم بسيط أو احتباس سوائل
3.	رد فعل تحسسي نادر..</p> 

      <h4>️⚕️ تحذيرات </h4>
<p> 
	الحذر الشديد عند: كبار السن / مرضى الكلى أو الكبد / من لديهم خطر هبوط السكر.
لا يُستخدم إذا لاحظتِ:
1.	تغيّر لون الإنسولين
2.	وجود تكتلات
3.	يجب تبديل أماكن الحقن لتجنب تكتل الدهون.
4.	تجنّب القيادة أو تشغيل الآلات عند الشعور بعلامات هبوط السكر.
.</p>
     <h4> طريقة استخدام الإنسولين </h4>
<p>
	التحضير قبل الحقن
1.	اغسل يديك جيدًا.
2.	تأكد أن الإنسولين ليس منتهي الصلاحية.
3.	تأكد من شكله

	اختيار مكان الحقن
أفضل الأماكن: البطن (الأسرع امتصاصًا) / الفخذين / الذراع العلوي / الأرداف.

	ملاحظة مهمة:
بدّل  مكان الحقن كل مرة لتجنب تكتل الدهون تحت الجلد (Lipodystrophy).

	خطوات الحقن باستخدام القلم (Insulin Pen)
1. أزيل الغطاء.
2. ركّب الإبرة الجديدة.
3. قم بعمل priming:
4.اضغط وحدتين للتأكد من خروج نقطة من الإنسولين.
5. اضبط الجرعة المطلوبة باستخدام القرص.
6. امسك الجلد بيدك (إن كان الدهون قليلة).
7. أدخل الإبرة بزاوية 90° (أو 45° في الأشخاص النحيفين).
8. اضغط زر الجرعة بالكامل.
9. انتظر 10 ثوانٍ قبل سحب الإبرة لضمان دخول الجرعة كاملة.
10. تخلص من الإبرة في علبة التخلص من الإبر (Sharps container).
	بعد الحقن
لا تقوم بتدليك مكان الحقن..</p>

      <h4>️ 📦 التخزين </h4>
<p>
	قبل الفتح:
يُحفظ في الثلاجة 2–8°C، بعيدًا عن التجميد.
	بعد الفتح (قلم/قارورة):
يُحفظ في درجة الغرفة لمدة 28–30 يومًا كحد أقصى.
	يُبعد عن الحرارة المباشرة وأشعة الشمس.
	لا يُجمَّد أبدًا..</p>
`},
  { name:"Actrapid HM Penfill", img:"https://i.ibb.co/qL7CKdYp/actrapid.jpg",
   type:"injections", 
   uses:"إنسولين سريع",
   short:"يُحقن قبل الوجبة بـ 30 دقيقة." ,
   details:`💉 ACTRAPID
   <h4> 🕒 ألية العمل </h4>
<p>
1.	يساعد على دخول الجلوكوز إلى الخلايا وخفض مستوى السكر في الدم.
2.	يقلل إنتاج الجلوكوز من الكبد.
3.	يغطي سكر الوجبة لأنه سريع المفعول نسبيًا مقارنة بالأنواع الأخرى.
. <p>

<h4> 🕒 💊 الاستخدامات الشائعة </h4>
<p>  
1.	السكري من النوع الأول (Type 1).
2.	السكري من النوع الثاني (Type 2) عند عدم كفاية الأقراص.
3.	تصحيح ارتفاع السكر (Correction insulin).
4.	يستخدم في طوارئ ارتفاع السكر أو الحماض الكيتوني (DKA) عبر الوريد بجرعات محددة.

	عادةً يُعطى 2–3 مرات يوميًا قبل الوجبات الرئيسية.
	يبدأ مفعوله خلال 30 دقيقة، ويصل لذروة خلال 2–4 ساعات، ويستمر 6–8 ساعات.
..</p>
      <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
	الشائعة:
1.	هبوط سكر الدم (Hypoglycemia)
2.	زيادة الوزن
3.	ألم أو احمرار في موضع الحقن

	الأقل شيوعًا:
1.	تورّم خفيف
2.	تكتلات دهنية (Lipodystrophy)
3.	حساسية نادرة جدًا للإنسولين
..</p> 

      <h4>️⚕️ تحذيرات </h4>
<p> 
	تغيير مواقع الحقن باستمرار لتجنب التكتلات.
	الحذر مع مرضى الكلى أو الكبد لضبط الجرعة.
	الانتباه لأعراض هبوط السكر:
رجفة – عرق – جوع – دوخة – نبض سريع
	يجب ضبط الجرعات عند: المرض/ النشاط البدني العالي/ تغيّر نمط الأكل

	عدم استخدام الإنسولين إذا تغيّر لونه أو أصبح عكرًا (Regular يجب أن يكون صافياً شفافاً).
.</p>
      <h4> طريقة استخدام الإنسولين </h4>
<p>
	التحضير قبل الحقن
1.اغسل يديك جيدًا.
2.تأكد أن الإنسولين ليس منتهي الصلاحية.
3.تأكد من شكله

	اختيار مكان الحقن
أفضل الأماكن: البطن (الأسرع امتصاصًا) / الفخذين / الذراع العلوي / الأرداف.

	ملاحظة مهمة:
بدّل  مكان الحقن كل مرة لتجنب تكتل الدهون تحت الجلد (Lipodystrophy).

	خطوات الحقن باستخدام القلم (Insulin Pen)

1. أزيل الغطاء.
2. ركّب الإبرة الجديدة.
3. قم بعمل priming:
4.اضغط وحدتين للتأكد من خروج نقطة من الإنسولين.
5. اضبط الجرعة المطلوبة باستخدام القرص.
6. امسك الجلد بيدك (إن كان الدهون قليلة).
7. أدخل الإبرة بزاوية 90° (أو 45° في الأشخاص النحيفين).
8. اضغط زر الجرعة بالكامل.
9. انتظر 10 ثوانٍ قبل سحب الإبرة لضمان دخول الجرعة كاملة.
10. تخلص من الإبرة في علبة التخلص من الإبر (Sharps container).
	بعد الحقن
لا تقوم بتدليك مكان الحقن..</p>

      <h4>️ 📦 التخزين </h4>
<p>
	قبل الفتح:
يُحفظ في الثلاجة 2–8°C، بعيدًا عن التجميد.
	بعد الفتح (قلم/قارورة):
يُحفظ في درجة الغرفة لمدة 28–30 يومًا كحد أقصى.
	يُبعد عن الحرارة المباشرة وأشعة الشمس.
	لا يُجمَّد أبدًا..</p>
   `},
  { name:"Insulatard Penfill", img:"https://i.ibb.co/3y6zCYB0/insulatard.jpg", type:"injections", 
   uses:"إنسولين متوسط", 
   short:"إنسولين متوسط المفعول – يحقن عادة مرة أو مرتين يوميًا." ,
   details:`💉 NPH Insulin (Intermediate-acting Insulin)
   <h4> 🕒 ألية العمل </h4>
<p>
1.	يحتوي على protamine الذي يبطّئ امتصاص الإنسولين.
2.	يعطي مفعولًا متوسطًا لتوفير إنسولين قاعدي مستمر لتغطية سكر الدم خلال اليوم والليل.
	يبدأ العمل: 1–2 ساعة
الذروة: 4–8 ساعات
المدة: 12–18 ساعة
. <p>
<h4> 🕒 💊 الاستخدامات الشائعة </h4>
<p>  
1.	علاج داء السكري النوع الأول.
2.	علاج النوع الثاني عند عدم كفاية الأقراص.
3.	يستخدم عادة كإنسولين قاعدي (Basal).
4.	يُستخدم أحيانًا في الحمل إذا احتاجت المريضة إنسولين طويل المفعول.
...</p>
      <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
	شائعة:
1.	انخفاض السكر (Hypoglycemia) خصوصًا في وقت الذروة.
2.	زيادة الوزن.
3.	احمرار أو ألم في موقع الحقن.
4.	نوبات جوع ورعشة بسبب الانخفاض.

	نادرة:
1.	حساسية للإنسولين أو البروتامين.
2.	تورم الأطراف.
3.	تغيرات بسيطة في البصر عند بدء العلاج.
..</p> 
      <h4>️⚕️ تحذيرات </h4>
<p> 
	الحذر الشديد عند: كبار السن / مرضى الكلى أو الكبد / من لديهم خطر هبوط السكر.
1.	خطر انخفاض السكر أكبر من اللانتوس (Glargine) بسبب الذروة.
2.	يجب تغيير مواقع الحقن لتجنب تكتلات الدهون.
3.	الذين لديهم نمط أكل غير منتظم
4.	لا يستخدم لعلاج الحماض الكيتوني (DKA).
.</p>
      <h4> طريقة استخدام الإنسولين </h4>
<p>
	التحضير قبل الحقن
1.	اغسل يديك جيدًا.
2.	تأكد أن الإنسولين ليس منتهي الصلاحية.
3.	تأكد من شكله
	اختيار مكان الحقن
أفضل الأماكن: البطن (الأسرع امتصاصًا) / الفخذين / الذراع العلوي / الأرداف.
	ملاحظة مهمة:
بدّل  مكان الحقن كل مرة لتجنب تكتل الدهون تحت الجلد (Lipodystrophy).
	خطوات الحقن باستخدام القلم (Insulin Pen)
1. أزيل الغطاء.
2. ركّب الإبرة الجديدة.
3. قم بعمل priming:
4.اضغط وحدتين للتأكد من خروج نقطة من الإنسولين.
5. اضبط الجرعة المطلوبة باستخدام القرص.
6. امسك الجلد بيدك (إن كان الدهون قليلة).
7. أدخل الإبرة بزاوية 90° (أو 45° في الأشخاص النحيفين).
8. اضغط زر الجرعة بالكامل.
9. انتظر 10 ثوانٍ قبل سحب الإبرة لضمان دخول الجرعة كاملة.
10. تخلص من الإبرة في علبة التخلص من الإبر (Sharps container).
	بعد الحقن
لا تقوم بتدليك مكان الحقن..</p>
      <h4>️ 📦 التخزين </h4>
<p>
	قبل الفتح:
يُحفظ في الثلاجة 2–8°C، بعيدًا عن التجميد.
	بعد الفتح (قلم/قارورة):
يُحفظ في درجة الغرفة لمدة 28–30 يومًا كحد أقصى.
	يُبعد عن الحرارة المباشرة وأشعة الشمس.
	لا يُجمَّد أبدًا.
	يُرج جيدًا قبل الاستخدام لأنه معلق cloudy وليس صافياً كالأنسولينات الأخرى.
	.</p>
      <h4>️ مميزات NPH </h4>
1.	اقتصادي وسعره منخفض.
2.	مناسب للحوامل.
	      <h4>️ ❌ عيوبه</h4>
1.	له ذروة واضحة→ خطر الانخفاض أكبر.
2.	يحتاج رج قبل الاستخدام.
3.	مفعوله غير ثابت مقارنة بالسواء الطويلة (Glargine/Detemir)
   `},
  
  { name:"Regular Insulin/ Insulin Human Regular", img:"https://i.ibb.co/Cp94pSYn/Whats-App-Image-2025-11-23-at-12-06-06-PM.png", 
   type:"injections", 
   uses:"إنسولين متوسط", 
   short:"يُحقن قبل الوجبة بـ 30 دقيقة." ,
   details:`💉 Regular Insulin/ Insulin Human Regular
   <h4> 🕒 ألية العمل </h4>
<p>
1.	يساعد على دخول الجلوكوز إلى الخلايا وخفض مستوى السكر في الدم.
2.	يقلل إنتاج الجلوكوز من الكبد.
3.	يغطي سكر الوجبة لأنه سريع المفعول نسبيًا مقارنة بالأنواع الأخرى.
. <p>

<h4> 🕒 💊 الاستخدامات الشائعة </h4>
<p>  
1.	السكري من النوع الأول (Type 1).
2.	السكري من النوع الثاني (Type 2) عند عدم كفاية الأقراص.
3.	تصحيح ارتفاع السكر (Correction insulin).
4.	يستخدم في طوارئ ارتفاع السكر أو الحماض الكيتوني (DKA) عبر الوريد بجرعات محددة.

	عادةً يُعطى 2–3 مرات يوميًا قبل الوجبات الرئيسية.
	يبدأ مفعوله خلال 30 دقيقة، ويصل لذروة خلال 2–4 ساعات، ويستمر 6–8 ساعات.
..</p>
      <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
	الشائعة:
1.	هبوط سكر الدم (Hypoglycemia)
2.	زيادة الوزن
3.	ألم أو احمرار في موضع الحقن

	الأقل شيوعًا:
1.	تورّم خفيف
2.	تكتلات دهنية (Lipodystrophy)
3.	حساسية نادرة جدًا للإنسولين
..</p> 

      <h4>️⚕️ تحذيرات </h4>
<p> 
	تغيير مواقع الحقن باستمرار لتجنب التكتلات.
	الحذر مع مرضى الكلى أو الكبد لضبط الجرعة.
	الانتباه لأعراض هبوط السكر:
رجفة – عرق – جوع – دوخة – نبض سريع
	يجب ضبط الجرعات عند: المرض/ النشاط البدني العالي/ تغيّر نمط الأكل

	عدم استخدام الإنسولين إذا تغيّر لونه أو أصبح عكرًا (Regular يجب أن يكون صافياً شفافاً).
.</p>
      <h4> طريقة استخدام الإنسولين </h4>
<p>
	التحضير قبل الحقن
1.	اغسل يديك جيدًا.
2.	تأكد أن الإنسولين ليس منتهي الصلاحية.
3.	تأكد من شكله
	اختيار مكان الحقن
أفضل الأماكن: البطن (الأسرع امتصاصًا) / الفخذين / الذراع العلوي / الأرداف.
	ملاحظة مهمة:
بدّل  مكان الحقن كل مرة لتجنب تكتل الدهون تحت الجلد (Lipodystrophy).
	خطوات الحقن باستخدام السرنجة (Vial + Syringe)
1. اسحب من الهواء مقدار نفس الجرعة المطلوبة.
2. أدخل الهواء في القارورة.
3. اقلب  القارورة واسحب الجرعة المطلوبة.
4. تخلص من الفقاعات الهوائية بالطرق الخفيف.
5. اختار مكان الحقن وادخل الإبرة بزاوية 90°.
6. احقن الجرعة ببطء ثم اسحب الإبرة.
	بعد الحقن
لا تقوم بتدليك مكان الحقن..</p>
      <h4>️ 📦 التخزين </h4>
<p>
	قبل الفتح:
يُحفظ في الثلاجة 2–8°C، بعيدًا عن التجميد.
	بعد الفتح (قلم/قارورة):
يُحفظ في درجة الغرفة لمدة 28–30 يومًا كحد أقصى.
	يُبعد عن الحرارة المباشرة وأشعة الشمس.
	لا يُجمَّد أبدًا..</p>
   `},
  
   { name:"NPH Insulin", img:"https://i.ibb.co/qY6qznTR/121969599-3197754213684075-1525594270401904602-n.png", type:"injections", 
   uses:"انسولين متوسط المفعول", 
   short:" يحقن عادة مرة أو مرتين يوميًا." ,
   details:`💉 NPH Insulin
   <h4> 🕒 ألية العمل </h4>
<p>
1.	يحتوي على protamine الذي يبطّئ امتصاص الإنسولين.
2.	يعطي مفعولًا متوسطًا لتوفير إنسولين قاعدي مستمر لتغطية سكر الدم خلال اليوم والليل.
	يبدأ العمل: 1–2 ساعة
الذروة: 4–8 ساعات
المدة: 12–18 ساعة
. <p>
<h4> 🕒 💊 الاستخدامات الشائعة </h4>
<p>  
1.	علاج داء السكري النوع الأول.
2.	علاج النوع الثاني عند عدم كفاية الأقراص.
3.	يستخدم عادة كإنسولين قاعدي (Basal).
4.	يُستخدم أحيانًا في الحمل إذا احتاجت المريضة إنسولين طويل المفعول.
...</p>
      <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
	شائعة:
1.	انخفاض السكر (Hypoglycemia) خصوصًا في وقت الذروة.
2.	زيادة الوزن.
3.	احمرار أو ألم في موقع الحقن.
4.	نوبات جوع ورعشة بسبب الانخفاض.
	نادرة:
1.	حساسية للإنسولين أو البروتامين.
2.	تورم الأطراف.
3.	تغيرات بسيطة في البصر عند بدء العلاج.
..</p> 
      <h4>️⚕️ تحذيرات </h4>
<p> 
	الحذر الشديد عند: كبار السن / مرضى الكلى أو الكبد / من لديهم خطر هبوط السكر.
1.	خطر انخفاض السكر أكبر من اللانتوس (Glargine) بسبب الذروة.
2.	يجب تغيير مواقع الحقن لتجنب تكتلات الدهون.
3.	الذين لديهم نمط أكل غير منتظم
4.	لا يستخدم لعلاج الحماض الكيتوني (DKA).
.</p>
     <h4> طريقة استخدام الإنسولين </h4>
<p>
	التحضير قبل الحقن
1.	اغسل يديك جيدًا.
2.	تأكد أن الإنسولين ليس منتهي الصلاحية.
3.	تأكد من شكله
	اختيار مكان الحقن
أفضل الأماكن: البطن (الأسرع امتصاصًا) / الفخذين / الذراع العلوي / الأرداف.
	ملاحظة مهمة:
بدّل  مكان الحقن كل مرة لتجنب تكتل الدهون تحت الجلد (Lipodystrophy).
	خطوات الحقن باستخدام السرنجة (Vial + Syringe)
1. اسحب من الهواء مقدار نفس الجرعة المطلوبة.
2. أدخل  الهواء في القارورة.
3. اقلب  القارورة واسحب الجرعة المطلوبة.
4. تخلص من الفقاعات الهوائية بالطرق الخفيف.
5. اختار مكان الحقن وادخل الإبرة بزاوية 90°.
6. احقن الجرعة ببطء ثم اسحب الإبرة.
	بعد الحقن
لا تقوم بتدليك مكان الحقن..</p>
      <h4>️ 📦 التخزين </h4>
<p>
	قبل الفتح:
يُحفظ في الثلاجة 2–8°C، بعيدًا عن التجميد.
	بعد الفتح (قلم/قارورة):
يُحفظ في درجة الغرفة لمدة 28–30 يومًا كحد أقصى.
	يُبعد عن الحرارة المباشرة وأشعة الشمس.
	لا يُجمَّد أبدًا.
	يُرج جيدًا قبل الاستخدام لأنه معلق cloudy وليس صافياً كالأنسولينات الأخرى.
	.</p>
   `},
   
  { name:"Mixtard 30/70 أو Insulin Human 30/70", img:"https://i.ibb.co/CsKz70xk/Whats-App-Image-2025-11-23-at-12-06-05-PM.png", 
   type:"injections", 
   uses:"إنسولين متوسط", 
   short:"التركيبة: 30% Insulin Regular سريع المفعول + 70% NPH طويل المفعول - يُحقن قبل الوجبة بـ 30 دقيقة." ,
   details:`💉 Mixtard 30/70 أو Insulin Human 30/70
   <h4> 🕒 ألية العمل </h4>
<p>
	الجزء السريع (Regular 30%):
يخفض السكر بعد الوجبة عبر تسهيل دخول الجلوكوز للخلايا.
	الجزء المتوسط (NPH 70%):
يعطي تغطية ممتدة لعدة ساعات ويحافظ على سكر الدم بين الوجبات وخلال الليل. <p>
<h4> 🕒 💊 الاستخدامات الشائعة </h4>
<p>  
4.	علاج داء السكري النوع الأول.
5.	علاج داء السكري النوع الثاني عند عدم سيطرة السكر على الأقراص فقط.
6.	مناسب للمرضى الذين يحتاجون لمزيج يغطي وجبة الطعام والبازال (الأساس اليومي) بنفس الوقت...</p>
     <h4>⚠️ الآثار الجانبية الشائعة </h4>
<p> 
	الأكثر شيوعًا:
4.	هبوط سكر الدم (Hypoglycemia)
5.	زيادة الوزن
6.	احمرار أو ألم مكان الحقن

	أقل شيوعًا:

4.	تكتلات دهنية مكان الحقن (Lipodystrophy)
5.	تورم بسيط أو احتباس سوائل
6.	رد فعل تحسسي نادر..</p> 
      <h4>️⚕️ تحذيرات </h4>
<p> 
	الحذر الشديد عند: كبار السن / مرضى الكلى أو الكبد / من لديهم خطر هبوط السكر.
لا يُستخدم إذا لاحظتِ:
5.	تغيّر لون الإنسولين
6.	وجود تكتلات
7.	يجب تبديل أماكن الحقن لتجنب تكتل الدهون.
8.	تجنّب القيادة أو تشغيل الآلات عند الشعور بعلامات هبوط السكر.
.</p>
      <h4> طريقة استخدام الإنسولين </h4>
<p>
	التحضير قبل الحقن
1.اغسل يديك جيدًا.
2.تأكد أن الإنسولين ليس منتهي الصلاحية.
3.تأكد من شكله
	اختيار مكان الحقن
أفضل الأماكن: البطن (الأسرع امتصاصًا) / الفخذين / الذراع العلوي / الأرداف.
	ملاحظة مهمة:
بدّل  مكان الحقن كل مرة لتجنب تكتل الدهون تحت الجلد (Lipodystrophy).
	خطوات الحقن باستخدام السرنجة (Vial + Syringe)
1. اسحب من الهواء مقدار نفس الجرعة المطلوبة.
2. أدخل الهواء في القارورة.
3. اقلب  القارورة واسحب الجرعة المطلوبة.
4. تخلص من الفقاعات الهوائية بالطرق الخفيف.
5. اختار مكان الحقن وادخل الإبرة بزاوية 90°.
6. احقن الجرعة ببطء ثم اسحب الإبرة.
	بعد الحقن
لا تقوم بتدليك مكان الحقن..</p>
      <h4>️ 📦 التخزين </h4>
<p>
	قبل الفتح:
يُحفظ في الثلاجة 2–8°C، بعيدًا عن التجميد.
	بعد الفتح (قلم/قارورة):
يُحفظ في درجة الغرفة لمدة 28–30 يومًا كحد أقصى.
	يُبعد عن الحرارة المباشرة وأشعة الشمس.
	لا يُجمَّد أبدًا..</p>
   `}
];

// العناصر
let currentCategory = "tablets";
let currentMedicine = null;

const gallery = document.getElementById("gallery");
const searchInput = document.getElementById("search");
const clearBtn = document.getElementById("clearSearch");
const modal = document.getElementById("modal");
const modalImg = document.getElementById("modal-img");
const modalName = document.getElementById("modal-name");
const modalUses = document.getElementById("modal-uses");
const moreModal = document.getElementById("moreModal");
const moreText = document.getElementById("more-text");

function showCategory(type){
  currentCategory = type;
  searchInput.value = "";
  renderMedicines(medicines.filter(m => m.type === type));
}

function renderMedicines(list){
  gallery.innerHTML = "";
  list.forEach(med => {
    const card = document.createElement("div");
    card.className = "card";
    card.innerHTML = `
      <img src="${med.img}">
      <h4>${med.name}</h4>
      <p>${med.uses}</p>
    `;
    card.onclick = () => openModal(med);
    gallery.appendChild(card);
  });
}

function openModal(med){
  currentMedicine = med;
  modalImg.src = med.img;
  modalName.textContent = med.name;
  modalUses.innerHTML = med.short ? med.short.replace(/\n/g, "<br>") : med.uses;
  modal.style.display = 'flex';
}


function closeModal(){ modal.style.display = "none"; }

function openMore(){
  moreText.innerHTML = currentMedicine.details.replace(/\n/g, "<br>");
  modal.style.display = "none";
  moreModal.style.display = "flex";
}

function closeMore(){ moreModal.style.display = "none"; }

searchInput.addEventListener("input", () => {
  const term = searchInput.value.toLowerCase();
  const result = medicines.filter(m =>
    m.type === currentCategory &&
    (m.name.toLowerCase().includes(term) || m.uses.toLowerCase().includes(term))
  );
  renderMedicines(result);
});

clearBtn.addEventListener("click", () => {
  searchInput.value = "";
  showCategory(currentCategory);
});

window.onclick = e => {
  if (e.target === modal) closeModal();
  if (e.target === moreModal) closeMore();
};

showCategory("tablets");